# ex06-Doing Math Across Table Columns

As we already know, the demo database (i.e., demo.db3) was extraced from a numerical hydrological modeling. The major data types are of integers, decimals, or floating points. It is quite natural that we want to carry out some calculations or statistical analysis. SQL can handle calculations ranging from basic math through advanced statistics.

***Basic Math Operators***
<li>+ Addition
<li>- Subtraction
<li>* Multiplication
<li>/ Division (returns the quotient only, no remainder)
<li>% Modulo (returns just the remainder)
<li>^ Exponentiation
<li>Others 
    
Let’s try to use the most frequently used SQL math operators on the demo data. Instead of using numbers in queries, we’ll use the names of the columns that contain the numbers. When we execute the query, the calculation will occur on each row of the table.

In [1]:
%load_ext sql

### 1. Connet to the given database of demo.db3

In [2]:
%sql sqlite:///data/demo.db3

u'Connected: @data/demo.db3'

If you do not remember the tables in the demo data, you can always use the following command to query.

In [3]:
%sql SELECT name FROM sqlite_master WHERE type='table'

 * sqlite:///data/demo.db3
Done.

[(u'rch',),
 (u'hru',),
 (u'sub',),
 (u'sed',),
 (u'watershed_daily',),
 (u'watershed_monthly',),
 (u'watershed_yearly',),
 (u'channel_dimension',),
 (u'hru_info',),
 (u'sub_info',),
 (u'rch_info',),
 (u'ave_plant',),
 (u'ave_annual_hru',),
 (u'ave_monthly_basin',),
 (u'ave_annual_basin',)]

### 2. Test Math Operator in an easy way

Using the SELECT statement, we can easily test the math operators.

In [4]:
%sql SELECT 3+4

 * sqlite:///data/demo.db3
Done.

[(7,)]

In [5]:
%sql SELECT 12 * 4

 * sqlite:///data/demo.db3
Done.

[(48,)]

In [6]:
%sql SELECT 12 % 4

 * sqlite:///data/demo.db3
Done.

[(0,)]

In [7]:
%sql SELECT round(123.456,2) as Rounded

 * sqlite:///data/demo.db3
Done.

[(123.46,)]

### 3. Doing Math Across Table Columns

Take the table of watershed_monthly as an example

#### 3.1 Check the table colums firstly.

In [8]:
%sql SELECT * From watershed_monthly LIMIT 3

 * sqlite:///data/demo.db3
Done.

[(1981, 1, 96.2901611328125, 0.5159813761711121, 0.4125469923019409, 6.688113689422607, 19.906705856323242, 0.0, 1854.2242431640625, 6.871741771697998, 12.269017219543457, 8.681976318359375, 0.17933471500873566, 0.00021739966177847236, 0.0022701763082295656, 1.3104768991470337, 0.0, 0.1262282431125641, 0.00011268912930972874, 0.015406808815896511, 0.0),
 (1981, 2, 160.22804260253906, 3.346802234649658, 0.6452788710594177, 9.148776054382324, 34.36812210083008, 0.0, 1766.2530517578125, 9.165532112121582, 14.773177146911621, 13.862184524536133, 1.2127171754837036, 0.0006267096032388508, 0.001955678453668952, 1.174126386642456, 0.0, 0.8965995907783508, 0.0005604379111900926, 0.10999998450279236, 0.0),
 (1981, 3, 136.6529083251953, 3.8249943256378174, 1.4813165664672852, 18.518495559692383, 34.367244720458984, 0.0, 1990.7535400390625, 13.520476341247559, 23.363500595092773, 25.018510818481445, 1.2629601955413818, 0.0008495681686326861, 0.007548550609499216, 0.5044968724250793, 0.0, 0.6799346208572388, 0.0005445934948511422, 0.08338834345340729, 0.0)]

#### 3.2 Calculate the difference between two colummns

For example, we are interested in the difference between Potential evapotranspiration (PET_mm) and precipitation (PREC_mm). It is so-called Potential evapotranspiration deficit (PED). PED can be thought of as a drought index. It is the difference between how much water could potentially be lost from the soil through evapotranspiration and how much is actually available. When PED is high, plants do not have the full amount of water available they need for growth.

In [9]:
%%sql sqlite://
SELECT YR, MO,  
PREC_mm as Precipitation, 
PET_mm as PET, 
PET_mm-PREC_mm as PED 
From watershed_monthly LIMIT 10

Done.

[(1981, 1, 96.2901611328125, 12.269017219543457, -84.02114391326904),
 (1981, 2, 160.22804260253906, 14.773177146911621, -145.45486545562744),
 (1981, 3, 136.6529083251953, 23.363500595092773, -113.28940773010254),
 (1981, 4, 118.85740661621094, 36.195560455322266, -82.66184616088867),
 (1981, 5, 84.54698181152344, 89.7725601196289, 5.225578308105469),
 (1981, 6, 44.83718490600586, 123.68331909179688, 78.84613418579102),
 (1981, 7, 32.325984954833984, 174.00889587402344, 141.68291091918945),
 (1981, 8, 20.65149688720703, 152.6374969482422, 131.98600006103516),
 (1981, 9, 16.57965660095215, 115.8529052734375, 99.27324867248535),
 (1981, 10, 59.67293167114258, 43.6953010559082, -15.977630615234375)]

###### We also can calculate the PED ratio to Precipitation.

In [10]:
%%sql sqlite://
SELECT YR, MO,  PREC_mm as Precipitation, 
PET_mm as PET, 
(PET_mm-PREC_mm)/PREC_mm*100.0 as PED_Ratio 
From watershed_monthly LIMIT 10

Done.

[(1981, 1, 96.2901611328125, 12.269017219543457, -87.25828571143332),
 (1981, 2, 160.22804260253906, 14.773177146911621, -90.7799053730202),
 (1981, 3, 136.6529083251953, 23.363500595092773, -82.90303449708202),
 (1981, 4, 118.85740661621094, 36.195560455322266, -69.54707200351655),
 (1981, 5, 84.54698181152344, 89.7725601196289, 6.180679896716599),
 (1981, 6, 44.83718490600586, 123.68331909179688, 175.84987628255342),
 (1981, 7, 32.325984954833984, 174.00889587402344, 438.29418072534986),
 (1981, 8, 20.65149688720703, 152.6374969482422, 639.1110570914423),
 (1981, 9, 16.57965660095215, 115.8529052734375, 598.7654090904647),
 (1981, 10, 59.67293167114258, 43.6953010559082, -26.775340456351415)]

#### 3.3 Use math operators in a WHERE statement

For example, we could use the modulus operator (%) to filter the MOs.

In [11]:
%%sql sqlite://
SELECT RCH, YR, MO, FLOW_INcms, FLOW_OUTcms 
From rch 
WHERE YR>2009 
and RCH=10 
and MO % 3 = 0

Done.

[(10, 2010, 3, 3.4298956394195557, 3.0846056938171387),
 (10, 2010, 6, 736.3016357421875, 734.9920654296875),
 (10, 2010, 9, 218.40797424316406, 218.24456787109375),
 (10, 2010, 12, 36.9558219909668, 36.877464294433594)]

### 4. Do some statistics with Aggregate Functions

So far, we’ve performed math operations across columns in each row of a table. We also can calculate a result from values within the same column using aggregate function, which calculate a single result from multiple inputs. Two of the most-used aggregate functions in data analysis are avg() and sum().

#### 4.1 average

avg - calculates the average of all values in that column (omits null values).

In [12]:
%%sql sqlite://
SELECT avg(FLOW_INcms), avg(FLOW_OUTcms) 
From rch

Done.

[(559.361707683415, 557.2792260827198)]

#### 4.2 sum

sum - calculates the sum of the values in that column (omits null values).

In [13]:
%%sql sqlite://
SELECT sum(FLOW_INcms), sum(FLOW_OUTcms) 
From rch

Done.

[(4631514.939618677, 4614271.9919649195)]

#### 4.3 extreme values

max - calculates the maximum value in that column (omits null values).

min - calculates the minimum value in that column (omits null values).

In [14]:
%%sql sqlite://
SELECT min(FLOW_INcms), max(FLOW_OUTcms) 
From rch

Done.

[(0.20121553540229797, 10499.5498046875)]

### 5. Calculate by ourselves

We can calculated some values by the combination of those math operators. For example, we can calculate the average values of Flow_In and Flow_Out.

In [15]:
%%sql sqlite://
SELECT sum(FLOW_INcms)/COUNT(FLOW_INcms) as AVG_FlowIn, 
sum(FLOW_OUTcms)/COUNT(FLOW_OUTcms) as AVG_FlowOut
From rch

Done.

[(559.361707683415, 557.2792260827198)]

### Summary

Aggregating data (also referred to as rolling up, summarizing, or grouping data) is creating some sort of total from a number of records. Sum, min, max, count, and average are common aggregate operations.

In fact, the above example did not present the real power of these aggregation functions. They will become more powerful only when they are used with ***GROUP BY*** and ***ORDER BY*** clauses.